#include <iostream>
using namespace std;

int main() {
    int выбор;

    do {
        cout << "\nМЕНЮ\n";
        cout << "1. Регламент рабочего времени\n";
        cout << "2. Проверка программного обеспечения\n";
        cout << "3. Материальная ответственность\n";
        cout << "4. Вся информация\n";
        cout << "5. Административная ответственность\n";
        cout << "6. Протокол реагирования\n";
        cout << "0. Завершить ознакомление\n";
        cout << "Выберите пункт: ";
        cin >> выбор;

        switch (выбор) {

        case 1:
            cout << "\nРегламент рабочего времени:\n";
            cout << "На 0,5 ставки обязательный объем работы — 20 часов в неделю.\n";
            break;

        case 2:
            cout << "\nПроверка программного обеспечения:\n";
            cout << "Лаборант обязан ежедневно до начала занятий\n";
            cout << "проверять работоспособность ПО на всех ноутбуках кабинета.\n";
            break;

        case 3:
            cout << "\nМатериальная ответственность:\n";
            cout << "Лаборант несет ответственность за сохранность\n";
            cout << "имущества компьютерного класса.\n";
            break;

        case 4:
            cout << "\nВся информация:\n";
            cout << "1. На 0,5 ставки — 20 часов в неделю.\n";
            cout << "2. Ежедневная проверка ПО на всех ноутбуках до начала занятий.\n";
            cout << "3. Ответственность за сохранность имущества класса.\n";
            break;

        case 5:
            cout << "\nАдминистративная ответственность:\n";
            cout << "При выявлении нарушения информация фиксируется\n";
            cout << "и передается ответственному руководителю.\n";
            break;
            
        case 6:
            cout << "\nПРОТОКОЛ РЕАГИРОВАНИЯ\n";
            cout << "1. Зафиксировать нарушение.\n";
            cout << "2. Уведомить ответственное лицо.\n";
            cout << "3. Проверить имеющиеся доказательства.\n";
            cout << "4. Подготовить служебную записку.\n";
            cout << "5. Передать информацию на рассмотрение.\n";
    break;

        case 0:
            cout << "\nПереходим к контрольному вопросу.\n";
            break;

        default:
            cout << "\nОшибка! Выберите пункт от 0 до 4.\n";
        }

    } while (выбор != 0);

    int ответ;

    do {
        cout << "\nСколько часов в неделю обязан отрабатывать лаборант на 0,5 ставки? ";
        cin >> ответ;

        if (ответ != 20) {
            cout << "Неверно! Повторите ввод.\n";
        }

    } while (ответ != 20);

    cout << "\nПравильно! Программа завершает работу.\n";

    return 0;
}
